app/controllers/post_comments_controller.rb

	def create
    book = Book.find(params[:book_id])
    @post_comment = current_user.post_comments.new(book_params)
    @post_comment.book_id = book.id
    if @post_comment.save
    	redirect_to book_path(book)
    else
        @book_new = Book.new
        @book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaaa"], ["user_id", 2], ["book_id", 3], ["created_at", "2020-05-03 07:45:25.602612"], ["updated_at", "2020-05-03 07:45:25.602612"]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

	def destroy
    book = Book.find(params[:book_id])
    comment = PostComment.find(params[:id])
    if comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 25]]